In [1]:
import pandas as pd

In [2]:
df= pd.read_csv('question 2.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [4]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [5]:
min_age=df.groupby(df.occupation).min().age
min_age.name= 'Min Age'

In [6]:
max_age= df.groupby(df.occupation).max().age
max_age.name= 'Max Age'

In [7]:
result= pd.DataFrame([min_age,max_age], columns=['Min Age', 'Max Age'])

In [8]:
pd.concat([min_age,max_age], axis=1)

               Min Age  Max Age
occupation
administrator       21       70
artist              19       48
doctor              28       64
educator            23       63
engineer            22       70
entertainment       15       50
executive           22       69
healthcare          22       62
homemaker           20       50
lawyer              21       53
librarian           23       69
marketing           24       55
none                11       55
other               13       64
programmer          20       63
retired             51       73
salesman            18       66
scientist           23       55
student              7       42
technician          21       55
writer              18       60

In [9]:
df.to_csv('answer2.csv')